dataFoam/test_data/case_1p0/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 6e-08;

boundaryField
{
    bottomWall
    {
		type            kLowReWallFunction;
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
		value			$internalField;
    }
    topWall
    {
		type            kLowReWallFunction;
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
		value			$internalField;
    }
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
